Revit 2024 API
ReferenceArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ReferenceArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ReferenceArrayIterator
Visual C++
public:
virtual ReferenceArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
ReferenceArray Class
Autodesk.Revit.DB Namespace